artillery/load-bench.yaml
# Artillery load testing
config:
  target: http://0.0.0.0:7090
  phases:
    - duration: 10
      arrivalRate: 10
      rampTo: 100
      name: Warm up phase
    - duration: 20
      arrivalRate: 100
      rampTo: 500
      name: Ramp up load
    - duration: 10
      arrivalRate: 500
      name: Maintain load
scenarios:
  - flow:
      - loop:
          - get:
              url: "/toudoux"
        count: 1